---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.DetailNumberDuplicate
source: html/40dfcadb-09c2-4f88-01fa-8d912f10edf7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.DetailNumberDuplicate Property

Detail Number is already in use. Enter a unique number.

## Syntax (C#)
```csharp
public static FailureDefinitionId DetailNumberDuplicate { get; }
```